src/Documents/ИТСервисы_ФормированиеКомандыПроекта/ИТСервисы_ФормированиеКомандыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ФормированиеКомандыПроекта</name>
  <registerRecords>InformationRegister.ИТСервисы_КомандыПроектов</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВКоманде</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыделяемыеЧасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РассчитанныйПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_КвалификацияСотрудников/ИТСервисы_КвалификацияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КвалификацияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Грейд</name>
    <type>
      <types>EnumRef.ИТСервисы_Грейды</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИТСервисы_КомпетенцииСотрудников/ИТСервисы_КомпетенцииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КомпетенцииСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Компетенция</name>
    <type>
      <types>CatalogRef.ИТСервисы_Компетенции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИТСервисы_Проекты/ИТСервисы_Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_Проекты</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПространствоKaiten</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПартнерыИКонтактныеЛица</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПартнера</name>
      <type>
        <types>CatalogRef.РолиПартнеровВСделкахИПроектах</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.КонтактныеЛицаПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребованияККоманде</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемыйГрейд</name>
      <type>
        <types>EnumRef.ИТСервисы_Грейды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательнаяКомпетенция</name>
      <type>
        <types>CatalogRef.ИТСервисы_Компетенции</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ИТСервисы_ФормированиеКомандыПроекта/Forms/ФормаПодбора/Module.bsl
&НаКлиенте
Процедура ВыбратьОтмеченных(Команда)
	МассивВозврата = Новый Массив;

	Для Каждого ИдентификаторСтроки Из Элементы.СписокСвободных.ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.СписокСвободных.ДанныеСтроки(ИдентификаторСтроки);
		Если ДанныеСтроки <> Неопределено Тогда
			ПараметрыСотрудника = Новый Структура("Сотрудник, Роль", ДанныеСтроки.Сотрудник, ДанныеСтроки.Роль);
			МассивВозврата.Добавить(ПараметрыСотрудника);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивВозврата.Количество() > 0 Тогда
		ОповеститьОВыборе(МассивВозврата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСвободныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	ДанныеСтроки = Элемент.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда Возврат; КонецЕсли;
	МассивВозврата = Новый Массив;
	МассивВозврата.Добавить(Новый Структура("Сотрудник, Роль", ДанныеСтроки.Сотрудник, ДанныеСтроки.Роль));
	ОповеститьОВыборе(МассивВозврата);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокСвободных.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	
	Если Параметры.Свойство("Проект") Тогда
		Проект = Параметры.Проект;
	КонецЕсли;

	Если Параметры.Свойство("УжеВыбранные") И Параметры.УжеВыбранные.Количество() > 0 Тогда
		МассивИсключений = Новый ФиксированныйМассив(Параметры.УжеВыбранные);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Проект) Тогда
		СтрогийОтбор = Истина;
	КонецЕсли;
	
	ОбновитьОтборыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтрогийОтборПриИзменении(Элемент)
	ОбновитьОтборыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборыНаСервере()
	СписокСвободных.Отбор.Элементы.Очистить();

	Если ТипЗнч(МассивИсключений) = Тип("ФиксированныйМассив") И МассивИсключений.Количество() > 0 Тогда
		ЭлементОтбора = СписокСвободных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		ЭлементОтбора.ПравоеЗначение = МассивИсключений;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;

	Если СтрогийОтбор И ЗначениеЗаполнено(Проект) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Квал.Сотрудник КАК Сотрудник
			|ИЗ
			|	Справочник.ИТСервисы_Проекты.ТребованияККоманде КАК Требования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИТСервисы_КвалификацияСотрудников.СрезПоследних(&ТекущаяДата, ) КАК Квал
			|		ПО Требования.Роль = Квал.Роль
			|			И Требования.ТребуемыйГрейд = Квал.Грейд
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИТСервисы_КомпетенцииСотрудников КАК Комп
			|		ПО Квал.Сотрудник = Комп.Сотрудник
			|ГДЕ
			|	Требования.Ссылка = &Проект
			|	И (Требования.ОбязательнаяКомпетенция = ЗНАЧЕНИЕ(Справочник.ИТСервисы_Компетенции.ПустаяСсылка)
			|		ИЛИ Требования.ОбязательнаяКомпетенция = Комп.Компетенция)";
		
		Запрос.УстановитьПараметр("Проект", Проект);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
		Результат = Запрос.Выполнить().Выгрузить();
		МассивПодходящих = Результат.ВыгрузитьКолонку("Сотрудник");
		
		ЭлементОтбора2 = СписокСвободных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора2.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		ЭлементОтбора2.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора2.ПравоеЗначение = МассивПодходящих;
		ЭлементОтбора2.Использование = Истина;
		
	КонецЕсли;	
КонецПроцедуры
